using System;

namespace HangmanClass.Scripts
{
    [Serializable]
    public class WordModel
    {
        public string Word;
        public string Description;
    }
}


//     Serializable в Unity это механизм, который позволяет сохранять данные объектов, чтобы их можно было
//     восстановить позже.Когда вы делаете объект Serializable, Unity может сериализовать(
//     то есть преобразовать в поток байтов)
//     его данные и сохранить их в файл на диске.Позже, когда вы загружаете этот файл, Unity может десериализовать(
//     то есть прочитать поток байтов и восстановить объект)
//     и вернуть объект в тот же самый состояние, в котором он был сохранен.Serializable очень полезен, когда вы
//     хотите сохранять данные между сеансами игры или передавать данные между сценами.Например, вы
//     можете сохранять прогресс игрока, такой как количество очков или пройденные уровни, и загружать его при
//     следующем запуске игры.